# THIS FILE IS AUTOMATICALLY GENERATED
# Project: \\files.auckland.ac.nz\myhome\Documents\Summer Research\Robot Soccer Code\EmbeddedCode\PsOC Project\Robot_PSoC_test.cydsn-20210126T222121Z-001\Robot_PSoC_test.cydsn\Robot_PSoC_test.cyprj
# Date: Thu, 28 Jan 2021 01:17:25 GMT
#set_units -time ns
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {UART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 27 53} -nominal_period 1083.3333333333333 [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 7 13} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 7 13} [list [get_pins {ClockBlock/dclk_glb_1}]]


# Component constraints for \\files.auckland.ac.nz\myhome\Documents\Summer Research\Robot Soccer Code\EmbeddedCode\PsOC Project\Robot_PSoC_test.cydsn-20210126T222121Z-001\Robot_PSoC_test.cydsn\TopDesign\TopDesign.cysch
# Project: \\files.auckland.ac.nz\myhome\Documents\Summer Research\Robot Soccer Code\EmbeddedCode\PsOC Project\Robot_PSoC_test.cydsn-20210126T222121Z-001\Robot_PSoC_test.cydsn\Robot_PSoC_test.cyprj
# Date: Thu, 28 Jan 2021 01:16:33 GMT
